Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_008/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 20.394ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 20.347ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.12ms    5.76ms 167.04ms   91.04%
    Req/Sec   100.72     88.44   404.00     39.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.23ms
 75.000%   19.34ms
 90.000%   22.64ms
 99.000%   38.65ms
 99.900%   80.25ms
 99.990%  161.66ms
 99.999%  167.17ms
100.000%  167.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.799     0.000000            1         1.00
      13.703     0.100000         3412         1.11
      14.703     0.200000         6798         1.25
      15.607     0.300000        10195         1.43
      16.415     0.400000        13596         1.67
      17.231     0.500000        17007         2.00
      17.615     0.550000        18725         2.22
      17.999     0.600000        20433         2.50
      18.383     0.650000        22074         2.86
      18.815     0.700000        23769         3.33
      19.343     0.750000        25499         4.00
      19.679     0.775000        26318         4.44
      20.063     0.800000        27190         5.00
      20.511     0.825000        28025         5.71
      21.055     0.850000        28862         6.67
      21.727     0.875000        29714         8.00
      22.159     0.887500        30141         8.89
      22.639     0.900000        30571        10.00
      23.199     0.912500        30990        11.43
      23.887     0.925000        31409        13.33
      24.847     0.937500        31833        16.00
      25.439     0.943750        32046        17.78
      26.015     0.950000        32259        20.00
      27.023     0.956250        32470        22.86
      28.063     0.962500        32682        26.67
      29.199     0.968750        32895        32.00
      29.903     0.971875        33002        35.56
      30.767     0.975000        33108        40.00
      31.759     0.978125        33214        45.71
      32.959     0.981250        33319        53.33
      34.687     0.984375        33425        64.00
      35.583     0.985938        33479        71.11
      36.607     0.987500        33530        80.00
      37.919     0.989062        33586        91.43
      39.231     0.990625        33637       106.67
      41.407     0.992188        33689       128.00
      42.111     0.992969        33716       142.22
      43.423     0.993750        33742       160.00
      45.119     0.994531        33769       182.86
      46.559     0.995313        33796       213.33
      48.927     0.996094        33822       256.00
      49.791     0.996484        33835       284.44
      50.559     0.996875        33848       320.00
      51.679     0.997266        33862       365.71
      54.079     0.997656        33875       426.67
      55.839     0.998047        33888       512.00
      56.735     0.998242        33895       568.89
      58.687     0.998437        33901       640.00
      64.543     0.998633        33908       731.43
      76.607     0.998828        33915       853.33
      81.087     0.999023        33921      1024.00
      86.783     0.999121        33925      1137.78
      90.047     0.999219        33929      1280.00
      94.975     0.999316        33931      1462.86
      96.639     0.999414        33935      1706.67
     101.951     0.999512        33938      2048.00
     103.487     0.999561        33940      2275.56
     105.279     0.999609        33941      2560.00
     107.711     0.999658        33943      2925.71
     139.519     0.999707        33945      3413.33
     144.511     0.999756        33946      4096.00
     144.639     0.999780        33947      4551.11
     149.119     0.999805        33948      5120.00
     161.151     0.999829        33949      5851.43
     161.407     0.999854        33950      6826.67
     161.407     0.999878        33950      8192.00
     161.663     0.999890        33951      9102.22
     161.663     0.999902        33951     10240.00
     162.687     0.999915        33952     11702.86
     162.687     0.999927        33952     13653.33
     162.687     0.999939        33952     16384.00
     162.815     0.999945        33953     18204.44
     162.815     0.999951        33953     20480.00
     162.815     0.999957        33953     23405.71
     162.815     0.999963        33953     27306.67
     162.815     0.999969        33953     32768.00
     167.167     0.999973        33954     36408.89
     167.167     1.000000        33954          inf
#[Mean    =       18.124, StdDeviation   =        5.762]
#[Max     =      167.040, Total count    =        33954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36002 requests in 3.00m, 29.29MB read
Requests/sec:    199.99
Transfer/sec:    166.59KB